Autodesk.Revit.DB.IFC.IFCFileWriteOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileWriteOptions.FileFormat
The file format of the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileWriteOptions.FileName
The full file name of the IFC file to be written.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileWriteOptions.#ctor
Creates a default IFCFileWriteOptions. The default file format is ifc.
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileWriteOptions
This class contains options to write an IFC file.
Since:
2013